//1) number33
//'number' - це стрінга, далі + грає роль оператора конкатенації
console.log('number' + 3 + 3);

//2)  3
// null перетворюеться на 0
console.log(null + 3);

//3) "qwerty"
// && повертає перший false, або якщо все істина, то останій true
console.log(5 && "qwerty");

//4) 42hillel
// + перед стрінгою перетворюе текст в число, тому виходить 42 потім + між числов 42 і стрінгом "hillel" автоматично перетворює число на рядок
console.log(+'40' + +'2' + "hillel");

//5) false
// Оператор - завжди виконує арифметичну дію, тому стрінга перетворюється на число. === порівнює не тільки значення, а й тип данних, не перетворюючи його. 
console.log('10' - 5 === 6);

//6) 1
// true перетворюється на 1, а false на 0; тому 0+1=1
console.log (true + false);

//7) NaN
// Оператор - завжди виконує арифметичну дію, але ми не можемо перетворити '4px' на число
console.log ('4px' - 3);

//8) 1
//- перетворює стрінгу на число
console.log ('4' - 3);

//9) 
// Оператор ** має вищий приорітет, тому 3 в ступені 0, це 1. Далі конкатенація з рядком.
console.log('6' + 3 ** 0);

//10) 3
// Оператор / завжди виконує арифметичну дію
console.log(12 / '6');

//11) 10false
//Оператор порівнює не тільки значення,а й тип, тут значення не рівні тому false. '10' це стрінг, + прцює як конкатенація і false стає стрінгою
console.log('10' + (5 === 6));

//12) false
// null не рівне нулю або порожньому рядку. null поводиться як false, але не дорівнює false.
console.log(null == '');

//13) 27
// Спочатку дія в дужках, тобто виходить 3. 3 у 3й степені 27.
console.log (3 ** (9 / 3));

//14) true
// Оператор !! подвійного заперечення, перетворює значення у boolean. == порівнює значення, із перетворенням типу данних, тобто "true" або "false" це 2 стрінгі,які не пусті і обидві true.
console.log(!!'false' == !!'true');

//15) 1
// && спочатку виконується. '0' це стрінга не пуста, тому true. true &&1 , якщо все тру, то повернеться останнє, тобто 1. 0 ||1, повертає перше тру, тобто 1.
console.log (0 || '0' && 1);

//16) false
// + перед null перетворює його на число - 0. 0 - це false. Тому (+null == false) це true, бо false дорівнює false. True це 1, 1<1 - не правда, тому відповідь false.
console.log ((+null == false) < 1);

//17) true
// Спочатку йде &&, тому буде false, бо && повертає перше false. || повертає перше true, тому false || true, буде true. 
console.log (false && true || true);

//18) false
// Спочатку дія в дужках, там буде true. && Повертає перше false, тому відповідь false.
console.log (false && (false || true));

//19) false
//Спочатку дія в дужках, + перед null перетворює його на число - 0. == порівнює і перетворює значення, тому  результат (+null == false) -> true. True це 1.
//1**5 Буде 1. Тому 1<1 - це false
console.log((+null == false) < 1 ** 5);